Revit 2022 API
ParameterUtils.GetParameterTypeId Method
 Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameter' enumeration to the ForgeTypeId class.")]
public static ForgeTypeId GetParameterTypeId(
	BuiltInParameter builtInParam
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameter' enumeration to the ForgeTypeId class.")> _
Public Shared Function GetParameterTypeId ( _
	builtInParam As BuiltInParameter _
) As ForgeTypeId
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'BuiltInParameter' enumeration to the ForgeTypeId class.")]
public:
static ForgeTypeId^ GetParameterTypeId(
	BuiltInParameter builtInParam
)
Parameters
builtInParam
Type: Autodesk.Revit.DB.BuiltInParameter
The BuiltInParameter value.
Return Value
Identifier of the parameter corresponding to the given BuiltInParameter value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace